import pandas as pd

def getTheme(name, theme):
    matched = 0  #점수
    db = pd.read_excel('DB_V21.xlsx', engine='openpyxl')
    db['키워드'] = db['키워드'].astype(str)
    
    #비교할 테마 그룹
    category = {'이국적인': ['유러피안스타일', '이국적'],
               '고급스러운' : ['고급스러운', '고급진', '근사한', '기품있는', '멋스러운', '세련된', '트렌디한', '화려한',
                         '우아한', '퀄리티있는', '웅장한'],
                '사진찍기좋은' : ['감각적인', '느낌있는', '깨끗한', '빈티지', '아기자기', '운치있는', '개성있는', '채광좋은',
                         '화사한', '사진_영상촬영'],
                '옛스런' : ['고즈넉한', '빈티지한', '옛모습'],
                '이색적인' : ['독특한분위기', '동화적인', '신비한', '재미있는', '유니크한', '신나는'],
                '낭만적인' : ['낭만적인', '따뜻한분위기', '분위기있는', '분위기좋은', '서정적인'],
                '힐링' : ['소박한', '수수한', '심플한', '아늑한', '아담한', '인심좋은', '친절하고', '친절한', '친절함',
                        '편안한', '평온한', '평화로운', '포근한', '프라이빗', '작은공간', '작은규모', '조그마한',
                        '쾌적한', '활기찬', '행복한'],
                '현대적인' : ['모던한', '캐주얼한', '트렌디한'],
                '나들이' : ['가을여행', '가족나들이', '기차여행', '나들이', '단풍구경', '드라이브', '봄꽃', '봄소풍',
                         '사진찍기', '유물', '유적', '주말나들이', '피크닉', '한강전망', '휴식', '힐링', '경치',
                         '비오는날', '숨겨진', '숨어있는', '숨은', '휴식_힐링', '가족여행', '자연경관_경치감상', '미성년자녀_동반'],
                '건강' : ['등산', '보양식', '산행', '신선한', '싱싱한', '웰빙', '유기농', '착한가격', '제철음식'],
                '즐길거리' : ['동물체험', '드라마촬영지', '자극적인', '재방문', '직업체험', '체험관', '촬영지',
                          '퓨전요리','한복체험', '체험학습', '레저_놀이'],
                '데이트' : ['기념일', '데이트', '발렌타인데이', '프로포즈', '크리스마스파티', '핫플레이스', '연인_배우자',]
                }

    if db['키워드'][db['검색명']==name].empty:
        return 0
    else:
        cmp = []    #비교할 대상
        for t in theme:
            cmp.extend(category[t]) #사용자가 선택한 테마의 키워드들을 비교 리스트에 담는다.
        print(cmp)
        kwd = db['키워드'][db['검색명']==name].iloc[0]
        print(kwd, type(kwd))
        for elem in kwd.split(','): # 해당 관광지의 키워드들을 하나씩 비교
            print(elem)
            if elem.strip() in cmp:
                matched += 1    #관광지의 테마키워드가 사용자가 선택한 테마의 키워드 리스트에 포함될 시에 점수 상승
    return matched
